#### Pandas-DataFrame And Series
Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns).

In [2]:
# pip install pandas

In [1]:
import pandas as pd

In [2]:
## Series
##A Pandas Series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table.

data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
## Create a Series from dictionary
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [4]:
data_2 = { "Name" : "Abhishek", "Age" : 30}
series_1 = pd.Series(data_2)
print(series_1)
print(type(series_1))

Name    Abhishek
Age           30
dtype: object
<class 'pandas.core.series.Series'>

In [5]:
data=[10,20,30]
lbl=['a','b','c']
pd.Series(data,index=lbl)

a    10
b    20
c    30
dtype: int64

In [6]:
## Dataframe
## create a Dataframe from a dictionary of list

data={
    'Name':['Amit','John','Jack'],
    'Age':[25,30,45],
    'City':['Bangalore','New York','Florida']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

   Name  Age       City
0  Amit   25  Bangalore
1  John   30   New York
2  Jack   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [7]:
data_21 ={
    "Name": ["Sapna", "Sonu"],
    "Gender": ["Female", "Male"],
    "DOB": ["20/10/1972", "1/02/1972"]
}

d = pd.DataFrame(data_21)
print(d)

    Name  Gender         DOB
0  Sapna  Female  20/10/1972
1   Sonu    Male   1/02/1972

In [19]:
## Create a Data frame From a List of Dictionaries

data=[
    {'Name':'Amit','Age':30,'City':'New Delhi'},
    {'Name':'John','Age':34,'City':'Bangalore'},
    {'Name':'Bappy','Age':32,'City':'Bangalore'},
    {'Name':'JAck','Age':32,'City':'Bangalore'}
    
]
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0   Amit   30  New Delhi
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore
<class 'pandas.core.frame.DataFrame'>

In [8]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [9]:
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

### Accessing column data from table

In [11]:
df['Transaction ID']

0      10001
1      10002
2      10003
3      10004
4      10005
       ...
235    10236
236    10237
237    10238
238    10239
239    10240
Name: Transaction ID, Length: 240, dtype: int64

In [24]:
df['Unit Price']

0      999.99
1      499.99
2       69.99
3       15.99
4       89.99
        ...
235    159.99
236     90.00
237     10.99
238     55.00
239     29.99
Name: Unit Price, Length: 240, dtype: float64

In [12]:
df['Units Sold']

0      2
1      1
2      3
3      4
4      1
      ..
235    1
236    3
237    3
238    1
239    2
Name: Units Sold, Length: 240, dtype: int64

In [13]:
## Create a Data frame From a List of Dictionaries

data=[
    {'Name':'Amit','Age':30,'City':'New Delhi'},
    {'Name':'John','Age':34,'City':'Bangalore'},
    {'Name':'Bappy','Age':32,'City':'Bangalore'},
    {'Name':'JAck','Age':32,'City':'Bangalore'}
    
]
df=pd.DataFrame(data)

In [14]:
### Accessing Data From Dataframe
df

    Name  Age       City
0   Amit   30  New Delhi
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore

In [15]:
df['Name']

0     Amit
1     John
2    Bappy
3     JAck
Name: Name, dtype: object

### Accessing data by rows

In [30]:
df.loc[0]

Name         Amit
Age            30
City    New Delhi
Name: 0, dtype: object

In [31]:
df.iloc[0]

Name         Amit
Age            30
City    New Delhi
Name: 0, dtype: object

In [16]:
df

    Name  Age       City
0   Amit   30  New Delhi
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore

In [33]:
## Accessing a specified element
df.at[2,'Age']

32

In [34]:
df.at[2,'City']

'Bangalore'

In [35]:
df.at[2,'Name']

'Bappy'

In [37]:
## Accessing a specified element using iat
df.iat[2,2]

'Bangalore'

In [38]:
df

    Name  Age       City
0   Amit   30  New Delhi
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore

In [17]:
### Data MAnipulation with Dataframe
df

    Name  Age       City
0   Amit   30  New Delhi
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore

In [18]:
## Adding a column
df['Salary']=[70000,60000,50000,80000]
df

    Name  Age       City  Salary
0   Amit   30  New Delhi   70000
1   John   34  Bangalore   60000
2  Bappy   32  Bangalore   50000
3   JAck   32  Bangalore   80000

### Explanation --
1

2. **`.drop('Salary', axis=1, inplace=True)`**: This is a method in pandas that removes a specified row or column from the DataFrame. Let's go over each parameter inside this method:

   - **`'Salary'`**: This is the name of the column that we want to remove from the DataFrame.
   
   - **`axis=1`**: The `axis` parameter specifies whether we want to drop rows or columns:
     - If `axis=0`, it removes rows.
     - If `axis=1`, it removes columns.
     Since we’re removing a column, we use `axis=1`.

   - **`inplace=True`**: The `inplace` parameter controls whether the removal is done directly on the original DataFrame or if a modified copy is returned. 
     - If `inplace=True`, it makes changes directly to the original DataFrame, and there’s no need to reassign the DataFrame to another variable.
     - If `inplace=False` (the default setting), a new DataFrame with the column removed is created and returned, leaving the original DataFrame unchanged.
     
   Using `inplace=True` saves memory and simplifies code when you don’t need to keep the original DataFrame  creating a new one.

In [19]:
## Remove a column
df.drop('Salary',axis=1,inplace=True)

In [20]:
df

    Name  Age       City
0   Amit   30  New Delhi
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore

In [21]:
## Add age to the column
df['Age']=df['Age']+1
df

    Name  Age       City
0   Amit   31  New Delhi
1   John   35  Bangalore
2  Bappy   33  Bangalore
3   JAck   33  Bangalore

In [22]:
df.drop(0,inplace=True)

In [23]:
df

    Name  Age       City
1   John   35  Bangalore
2  Bappy   33  Bangalore
3   JAck   33  Bangalore

In [24]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [25]:
# Display the data types of each column
print("Data types:\n", df.dtypes)

Data types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object

In [26]:
# Describe the DataFrame
print("Statistical summary:\n", df.describe())

Statistical summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [27]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000